app/Http/Controllers/CaverneController.php

select * from `cavernes`
---
    public function index()
    {
        try {
            $cavernes = Caverne::all();

insert into `cavernes` (`titre`, `image`, `audio`, `updated_at`, `created_at`) values ('kqsdksq', 'C:\Users\User\AppData\Local\Temp\phpB05.tmp', 'audios/9yWKieROA5aZjEavYvSq6De8VbBKsEvhmClv34XZ.mp3', '2024-04-14 14:10:20', '2024-04-14 14:10:20')
select * from `cavernes` order by `id` desc limit 1
---
    public function store(Request $request)
    {
        try{
            //Validation des données entrée
        $validator = Validator::make($request->all(), [
            'titre' => 'required|min:2',
        ]);
        if ($validator->fails()) {
            return back()->withErrors($validator)->withInput();
        }

        $newCaverne = new Caverne();
        $newCaverne->titre = $request->input('titre');
        $newCaverne->image = $request->input('image');
        $newCaverne->audio = $request->input('audio');
        $newCaverne->save();
        return redirect()->route('caverne.index')->with('succes', 'Caverne créée avec succès!');